<script setup>
import HeaderTop from "@/components/HeaderTop.vue";
import HeaderMiddle from "@/components/HeaderMiddle.vue";
import HeaderBottom from "@/components/HeaderBottom.vue";
</script>

<template>
  <div class="page-container">
    <div class="header-component">
      <HeaderTop></HeaderTop>
      <HeaderMiddle></HeaderMiddle>
      <HeaderBottom></HeaderBottom>
    </div>
    <main>
      <section class="about-us" id="about">
        <div class="container mx-auto px-4">
          <!-- Заголовок -->
          <div class="mb-8">
            <h2 class="text-3xl font-bold text-center">
              <span>О нас</span>
            </h2>
          </div>
          <!-- Основной контент -->
          <div class="flex flex-col space-y-4">
            <p>
              Добро пожаловать в фитнес-центр Adrenalin – Ваше идеальное место
              для достижения здоровья, силы и гармонии! Мы находимся в самом
              сердце Минска, по адресу: ул. Иосифа Гошкевича 3.
            </p>
            <p>
              Наша команда профессионалов готова помочь Вам на пути к активному
              и здоровому образу жизни. В Adrenalin мы стремимся создать
              уникальную атмосферу, где каждый гость чувствует себя комфортно и
              вдохновленно. Наша миссия – предоставить Вам не только
              высококачественные тренировки, но и общение с единомышленниками,
              которые поддержат Вас в Вашем фитнес-путешествии.
            </p>
            <p>
              Мы предлагаем разнообразные групповые занятия, индивидуальные
              тренировки, а также специализированные программы, подходящие для
              всех уровней подготовки. Каждый клиент – это уникальная история, и
              мы готовы подойти к каждому с индивидуальным подходом. Наши
              тренеры – это команда сертифицированных специалистов, обладающих
              большим опытом и знаниями в области фитнеса и здоровья. Они всегда
              готовы поделиться своими секретами успеха и помочь Вам в
              достижении Ваших целей.
            </p>
            <p>
              Кроме того, в нашем фитнес-центре Вы найдете современные
              тренажеры, комфортные зоны для отдыха и полезные рекомендации по
              питанию. Мы обеспечим Вас всем необходимым для достижения
              великолепных результатов.
            </p>
            <p>
              Присоединяйтесь к нам в Adrenalin и начните свой путь к лучшей
              версии себя уже сегодня! Вместе мы сможем достичь невероятных
              высот! Контакты Мы будем рады видеть Вас в наших стенах! Если у
              Вас есть вопросы, не стесняйтесь обращаться к нам. Перезвоните,
              напишите или приходите на бесплатную консультацию!
            </p>
            <p>Адрес: Минск, ул. Иосифа Гошкевича 3</p>
            <p>
              Телефон:
              <a href="tel:375298525312" class="text-blue-600 hover:underline"
                >+375-29-8525312</a
              >
            </p>
            <p>
              Электронная почта:
              <a
                href="mailto:kristinababichvic@gmail.com"
                class="text-blue-600 hover:underline"
                >kristinababichvic@gmail.com</a
              >
            </p>
            <p>
              Следите за новостями и акциями на наших страницах в социальных
              сетях! Давайте вместе сделаем Ваш фитнес-путь увлекательным и
              эффективным! 💪✨
            </p>
          </div>
        </div>
      </section>
    </main>
  </div>
</template>
